---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnyPatternIdParamNoNo
source: html/8e44077f-007c-7b8a-5499-084896ee8894.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnyPatternIdParamNoNo Property

"Fill Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId AnyPatternIdParamNoNo { get; }
```